name: "summarize_model"
platform: "python"
max_batch_size: 1

input [
  {
    name: "INPUT_DATA"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "OUTPUT_DATA"
    data_type: TYPE_STRING
    dims: [1]
  }
]
